{
        "id": 0,
        "emoji": "🎉",
        "slug": "welcome-to-the-site",
        "title": "Welcome to the new website!",
        "date": "5th October 2025",
        "description":"This first blog post contains my thought process and intentions of the new website redesign.",

        "paragraph1": "Welcome to the new website! This is my first time writing a blog post, so bare with me. For some background, my name is Daniel Steele, I'm a junior web developer based in Devon, in the South West of the UK.",

        "paragraph2": "In the past 8 months while looking for work, i've been creating personal projects in React, JavaScript and eventially also TypeScript. Front-end development is the field I'm most skilled in, and putting together clean UI and smooth UX is my genuine passion. You can find out more about me by clicking 'About' in the top navigation bar." ,

        "paragraph3": "With this site specifically, I really wanted to break away from the standard mould that most other graduate / junior front end developers follow. A single page, standard template/scroll down page with no personality or uniqueness. I also had one of these websites, because it was what everyone else was doing - and to be honest, there's only so much you can add on to a single page before things get messy/look overdone. (though i have seen some amazing ones). So, I decided to do some research.",
        
        "paragraph4": "I spent some time looking through a popular github portfolio site list, and reviewed what I liked, and what I didn't like. I realised that you need you leave an impression, and fast, if you're going to get noticed. I also learnt that flashy animations and introduction cards is very overrated - so, I got to work .",
         
        "paragraph5": "The goal of this new redesign was to emphisise a clean design. Nothing too flashy or over the top, just something expandable, simple yet clean and impressive looking, as well as having some personality. I went with a multi-page design this time, allowing me to expand the amount of content I could include. It's also let my create this blog, which is something i've always wanted to create.",

        "paragraph6": "If you got this far in the post, thanks for reading! In the coming months, i'll be using this blog to share how I created my projects, what I've learnt, my thought process behind learning new skills, and some general thoughts on the industry as a whole."
        
}